{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### A. Яблоки\n",
    "\n",
    "Компания мальчиков нарвала в саду яблок. Они хотят разделить яблоки между собой поровну, а то что останется, отдать маме на пирог. Определите, сколько яблок достанется каждому из них, а сколько они отдадут маме."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 1\n"
     ]
    }
   ],
   "source": [
    "N = int(input())\n",
    "M = int(input())\n",
    "\n",
    "apples_for_boys = M//N\n",
    "apples_for_pie = M%N\n",
    "\n",
    "print(apples_for_boys, apples_for_pie)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### B. Вася, внимательнее\n",
    "\n",
    "На вход вашей программе оператор Вася вводит два целых числа, A и B. Если A > B, то программа должна вывести их сумму, иначе вывести их произведение. Проблема заключается в том, что Вася печатает быстро и иногда печатает не только цифры, но и буквы. Ваша программа должна корректно обработать и случай ошибочного ввода."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вася, внимательнее\n"
     ]
    }
   ],
   "source": [
    "try:\n",
    "    A = int(input())\n",
    "    B = int(input())\n",
    "    if A>B:\n",
    "        print(A+B)\n",
    "    else:\n",
    "        print(A*B)\n",
    "except ValueError:\n",
    "    print(\"Вася, внимательнее\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### C. Треугольники\n",
    "\n",
    "На вход подаются три вещественных числа. Напишите программу, которая определяет, возможно ли составить треугольник с длинами сторон, равными этим числам. Если треугольник возможно составить, то определить, является он прямоугольным, тупоугольным или остроугольным."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Остроугольный\n"
     ]
    }
   ],
   "source": [
    "a = float(input())\n",
    "b = float(input())\n",
    "c = float(input())\n",
    "\n",
    "ll = [a,b,c]\n",
    "\n",
    "MAX = max(ll)\n",
    "ll.remove(MAX)\n",
    "if (ll[0]+ll[1]-MAX)*(ll[1]+MAX-ll[0])*(MAX+ll[0]-ll[1]) > 0:\n",
    "    if MAX**2 > ll[0]**2+ll[1]**2:\n",
    "        print('Тупоугольный')\n",
    "    elif MAX**2 == ll[0]**2+ll[1]**2:\n",
    "        print('Прямоугольный')\n",
    "    elif MAX**2 < ll[0]**2+ll[1]**2:\n",
    "        print('Остроугольный')\n",
    "else:\n",
    "    print('Нельзя')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### D. Кошелек\n",
    "\n",
    "Анне подарили волшебный кошелёк: если на ночь положить в него одну монету, утром там будет пять. Анна проверила, что это работает только если монета одна: если положить вечером в кошелёк большее число монет, их количество с утра не изменится.\n",
    "Сейчас у Анны одна монета. Сколько монет будет у неё через N дней?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "33\n"
     ]
    }
   ],
   "source": [
    "cost = 1\n",
    "N = int(input())\n",
    "a = 0\n",
    "while a < N:\n",
    "    a += 1\n",
    "    if cost == 1:\n",
    "        cost += 4\n",
    "    else:\n",
    "        cost += 4\n",
    "print(cost)"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "9754a918a9a43bab896c1fe055ce24b338f775ec600da2a8dd08a327af3da562"
  },
  "kernelspec": {
   "display_name": "Python 3.9.7 ('base')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
